_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ОбъектыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ОбъектыСтроительства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъектаСтроительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГенподрядчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМесячныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНедельноСуточныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураРаботЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиЗаполнятьПлановыйРасходМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьФактРаботыВодителейТехникиПутевымиЛистами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМатериалы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовИсполнители</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМеханизмы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроектMSP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторОбъектныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_214ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВестиРаспределениеМатериаловПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСводныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_НоменклатураДляЗаказаПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ОбъектСтроительстваERP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ИндекснаяСтраницаWebKit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_РолиУчастниковСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СценарииПланированияПроектовСтроительства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзMSProject</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьКритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовКритичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКодаСДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДлительностиЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ОбъектыСтроительства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает ссылки на базовый и рабочий сценарий по объекту строительства.
//
// Параметры:
//	Объект - СправочникОбъект.СМ_ОбъектыСтроительства - элемент справочника проектов строительства;
//
// Возвращаемое значение:
//               – Структура – структура с ключами:
//                             * БазовыйСценарийПланирования;
//                             * РабочийСценарийПланирования.
//
Функция ПолучитьБазовыйИРабочийСценарийПланирования(Объект) Экспорт
	
	СтруктураСценариев = Новый Структура("БазовыйСценарийПланирования, РабочийСценарийПланирования");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Ссылка,
	|	УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария КАК ВидСценария
	|ИЗ
	|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|ГДЕ
	|	(УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Базовый)
	|			ИЛИ УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий))
	|	И УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &Владелец
	|	И УСОERP_СценарииПланированияПроектовСтроительства.НомерВерсии = 0");
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	ТаблицаСценариев = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСценарий Из ТаблицаСценариев Цикл
		
		Если СтрокаСценарий.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Базовый Тогда
			СтруктураСценариев.Вставить("БазовыйСценарийПланирования", СтрокаСценарий.Ссылка);
		ИначеЕсли СтрокаСценарий.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий Тогда
			СтруктураСценариев.Вставить("РабочийСценарийПланирования", СтрокаСценарий.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	Возврат СтруктураСценариев;

КонецФункции // ПолучитьБазовыйИРабочийСценарийПланирования()

// Создает сценарии планирования по умолчанию.
//
// Параметры:
//	Объект - СправочникОбъект.СМ_ОбъектыСтроительства - элемент справочника проектов строительства;
//  Отказ  - Булево - признак неудачного создания элементов.
//
Процедура СоздатьСценарииПланированияПоУмолчанию(Объект, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСценариев = ПолучитьБазовыйИРабочийСценарийПланирования(Объект);
	
	НачатьТранзакцию();
	
	Если НЕ ЗначениеЗаполнено(СтруктураСценариев.БазовыйСценарийПланирования) Тогда
		
		НовыйСценарий                        = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.СоздатьЭлемент();
		НовыйСценарий.Владелец               = Объект.Ссылка;
		НовыйСценарий.ВидСценария            = Перечисления.УСОERP_ВидыСценариевПланирования.Базовый;
		НовыйСценарий.Наименование           = "Базовый";
		НовыйСценарий.НачалоСтроительства    = Объект.НачалоСтроительства;
		НовыйСценарий.ОкончаниеСтроительства = Объект.ОкончаниеСтроительства;
		
		НовыйСценарий.ОбменДанными.Загрузка = Истина;
		
		Попытка
			НовыйСценарий.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураСценариев.РабочийСценарийПланирования) Тогда
		
		НовыйСценарий                        = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.СоздатьЭлемент();
		НовыйСценарий.Владелец               = Объект.Ссылка;
		НовыйСценарий.ВидСценария            = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий;
		НовыйСценарий.Наименование           = "Рабочий";
		НовыйСценарий.НачалоСтроительства    = Объект.НачалоСтроительства;
		НовыйСценарий.ОкончаниеСтроительства = Объект.ОкончаниеСтроительства;
		
		НовыйСценарий.ОбменДанными.Загрузка = Истина;
		
		Попытка
			НовыйСценарий.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры // СоздатьСценарииПланированияПоУмолчанию()

Процедура СкопироватьСметы(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	Стройка = ПараметрыВызоваСервера.Стройка;
	НоваяСтройка = ПараметрыВызоваСервера.НоваяСтройка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ЛокальнаяСмета.Ссылка
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |ГДЕ
	               |	СМ_ЛокальнаяСмета.Стройка = &Стройка
	               |	И НЕ СМ_ЛокальнаяСмета.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СМ_ЛокальнаяСмета.МоментВремени";
	Запрос.УстановитьПараметр("Стройка",Стройка);
	Результат =  Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Структура = Новый Структура("ТекстСообщения",НСтр("ru = 'По объекту сметы не найдены'"));
	Иначе
		СМ_СметаВызовСервера.СкопироватьЛокальныеСметыОбъектаСтроительства(Результат,НоваяСтройка);
		Структура = Новый Структура("ТекстСообщения",НСтр("ru = 'Сметы скопированы'"));
	КонецЕсли;
	АдресХранилища = ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
